In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
data= {
    "Name": ["Jovanie", "Sal Gilad", "Daniel", "Jim Christer", "Keint Joseph", "Denzel", "Kenji", "Gilbert", "Dhan Alher", "Clarenz", "Myca", "Eunice", "Debbie Marie", "Rhiza", "Mae", "Riezel", "Neslie", "Aira", "Juilie", "Lester"],
    "Age": [21,22,22,21,21,22,23,24,22,21,20,21,20,22,22,21,21,23,21,20],
    "Salary": [20000,4000,4000,2111,2222,4444,5555,1111,24242,21212,554,45454,312312,55151,242141,212312,31231,5676,8799,31231],
    "Position": ["Student","Teacher","Programmer","Tambay","Tanod","Panday","CEO","Foreman","Construction Worker","Tindera","Unemployed","Salary Man","Army","Police","Marines","Gym Rat","Alcholic","Racist","Moe","Cute",]
}
df=pd.DataFrame(data)

In [6]:
print('Dataset: ')
print(df)

Dataset:
            Name  Age  Salary             Position
0        Jovanie   21   20000              Student
1      Sal Gilad   22    4000              Teacher
2         Daniel   22    4000           Programmer
3   Jim Christer   21    2111               Tambay
4   Keint Joseph   21    2222                Tanod
5         Denzel   22    4444               Panday
6          Kenji   23    5555                  CEO
7        Gilbert   24    1111              Foreman
8     Dhan Alher   22   24242  Construction Worker
9        Clarenz   21   21212              Tindera
10          Myca   20     554           Unemployed
11        Eunice   21   45454           Salary Man
12  Debbie Marie   20  312312                 Army
13         Rhiza   22   55151               Police
14           Mae   22  242141              Marines
15        Riezel   21  212312              Gym Rat
16        Neslie   21   31231             Alcholic
17          Aira   23    5676               Racist
18        Juilie   21    8799                  Moe
19        Lester   20   31231                 Cute

In [8]:
mean_salary=df['Salary'].mean()
std_salaray=df['Salary'].std()
threshold=1.5*std_salaray